Revit 2027 API
ExtendedPropertiesLinkLoadContent Methods
The ExtendedPropertiesLinkLoadContent type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from ExternalResourceLoadContent)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetExtendedPropertiesLinkData |  Sets the extended properties data from the external server.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExtendedPropertiesLinkLoadContent Class
Autodesk.Revit.DB.ExternalData Namespace